espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/lp_spi_struct.h
/** Group: LP SPI DIN MODE REG */
/** Type of spi_din_mode register
 *  SPI input delay mode configuration
 */
typedef union {
    struct {
        /** reg_din0_mode : R/W; bitpos: [1:0]; default: 0;
         *  the input signals are delayed by SPI module clock cycles, 0: input without delayed,
         *  1: input with the posedge of clk_apb,2 input with the negedge of clk_apb, 3: input
         *  with the spi_clk. Can be configured in CONF state.
         */
        uint32_t reg_din0_mode:2;
        /** reg_din1_mode : R/W; bitpos: [3:2]; default: 0;
         *  the input signals are delayed by SPI module clock cycles, 0: input without delayed,
         *  1: input with the posedge of clk_apb,2 input with the negedge of clk_apb, 3: input
         *  with the spi_clk. Can be configured in CONF state.
         */
        uint32_t reg_din1_mode:2;
        /** reg_din2_mode : R/W; bitpos: [5:4]; default: 0;
         *  the input signals are delayed by SPI module clock cycles, 0: input without delayed,
         *  1: input with the posedge of clk_apb,2 input with the negedge of clk_apb, 3: input
         *  with the spi_clk. Can be configured in CONF state.
         */
        uint32_t reg_din2_mode:2;
        /** reg_din3_mode : R/W; bitpos: [7:6]; default: 0;
         *  the input signals are delayed by SPI module clock cycles, 0: input without delayed,
         *  1: input with the posedge of clk_apb,2 input with the negedge of clk_apb, 3: input
         *  with the spi_clk. Can be configured in CONF state.
         */
        uint32_t reg_din3_mode:2;
        uint32_t reserved_8:8;
        /** reg_timing_hclk_active : R/W; bitpos: [16]; default: 0;
         *  1:enable hclk in SPI input timing module.  0: disable it. Can be configured in CONF
         *  state.
         */
        uint32_t reg_timing_hclk_active:1;
        uint32_t reserved_17:15;
    };
    uint32_t val;
} lp_spi_din_mode_reg_t;


/** Group: LP SPI DIN NUM REG */
/** Type of spi_din_num register
 *  SPI input delay number configuration
 */
typedef union {
    struct {
        /** reg_din0_num : R/W; bitpos: [1:0]; default: 0;
         *  the input signals are delayed by SPI module clock cycles, 0: delayed by 1 cycle, 1:
         *  delayed by 2 cycles,...  Can be configured in CONF state.
         */
        uint32_t reg_din0_num:2;
        /** reg_din1_num : R/W; bitpos: [3:2]; default: 0;
         *  the input signals are delayed by SPI module clock cycles, 0: delayed by 1 cycle, 1:
         *  delayed by 2 cycles,...  Can be configured in CONF state.
         */
        uint32_t reg_din1_num:2;
        /** reg_din2_num : R/W; bitpos: [5:4]; default: 0;
         *  the input signals are delayed by SPI module clock cycles, 0: delayed by 1 cycle, 1:
         *  delayed by 2 cycles,...  Can be configured in CONF state.
         */
        uint32_t reg_din2_num:2;
        /** reg_din3_num : R/W; bitpos: [7:6]; default: 0;
         *  the input signals are delayed by SPI module clock cycles, 0: delayed by 1 cycle, 1:
         *  delayed by 2 cycles,...  Can be configured in CONF state.
         */
        uint32_t reg_din3_num:2;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} lp_spi_din_num_reg_t;


/** Group: LP SPI DOUT MODE REG */
/** Type of spi_dout_mode register
 *  SPI output delay mode configuration
 */
typedef union {
    struct {
        /** reg_dout0_mode : R/W; bitpos: [0]; default: 0;
         *  The output signal $n is delayed by the SPI module clock, 0: output without delayed,
         *  1: output delay for a SPI module clock cycle at its negative edge. Can be
         *  configured in CONF state.
         */
        uint32_t reg_dout0_mode:1;
        /** reg_dout1_mode : R/W; bitpos: [1]; default: 0;
         *  The output signal $n is delayed by the SPI module clock, 0: output without delayed,
         *  1: output delay for a SPI module clock cycle at its negative edge. Can be
         *  configured in CONF state.
         */
        uint32_t reg_dout1_mode:1;
        /** reg_dout2_mode : R/W; bitpos: [2]; default: 0;
         *  The output signal $n is delayed by the SPI module clock, 0: output without delayed,
         *  1: output delay for a SPI module clock cycle at its negative edge. Can be
         *  configured in CONF state.
         */
        uint32_t reg_dout2_mode:1;
        /** reg_dout3_mode : R/W; bitpos: [3]; default: 0;
         *  The output signal $n is delayed by the SPI module clock, 0: output without delayed,
         *  1: output delay for a SPI module clock cycle at its negative edge. Can be
         *  configured in CONF state.
         */
        uint32_t reg_dout3_mode:1;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} lp_spi_dout_mode_reg_t;


/** Group: LP SPI DMA CONF REG */
/** Type of spi_dma_conf register
 *  SPI DMA control register
 */
typedef union {
    struct {
        uint32_t reserved_0:29;
        /** reg_rx_afifo_rst : WT; bitpos: [29]; default: 0;
         *  Set this bit to reset RX AFIFO, which is used to receive data in SPI master and
         *  slave mode transfer.
         */
        uint32_t reg_rx_afifo_rst:1;
        /** reg_buf_afifo_rst : WT; bitpos: [30]; default: 0;
         *  Set this bit to reset BUF TX AFIFO, which is used send data out in SPI slave CPU
         *  controlled mode transfer and master mode transfer.
         */
        uint32_t reg_buf_afifo_rst:1;
        uint32_t reserved_31:1;
    };
    uint32_t val;
} lp_spi_dma_conf_reg_t;


/** Group: LP SPI DMA INT ENA REG */
/** Type of spi_dma_int_ena register
 *  SPI DMA interrupt enable register
 */
typedef union {
    struct {
        uint32_t reserved_0:10;
        /** reg_slv_rd_buf_done_int_ena : R/W; bitpos: [10]; default: 0;
         *  The enable bit for SPI_SLV_RD_BUF_DONE_INT interrupt.
         */
        uint32_t reg_slv_rd_buf_done_int_ena:1;
        /** reg_slv_wr_buf_done_int_ena : R/W; bitpos: [11]; default: 0;
         *  The enable bit for SPI_SLV_WR_BUF_DONE_INT interrupt.
         */
        uint32_t reg_slv_wr_buf_done_int_ena:1;
        /** reg_trans_done_int_ena : R/W; bitpos: [12]; default: 0;
         *  The enable bit for SPI_TRANS_DONE_INT interrupt.
         */
        uint32_t reg_trans_done_int_ena:1;
        uint32_t reserved_13:1;
        /** reg_spi_wakeup_int_ena : R/W; bitpos: [14]; default: 0;
         *  The enable bit for SPI_WAKEUP_INT interrupt
         */
        uint32_t reg_spi_wakeup_int_ena:1;
        /** reg_slv_buf_addr_err_int_ena : R/W; bitpos: [15]; default: 0;
         *  The enable bit for SPI_SLV_BUF_ADDR_ERR_INT interrupt.
         */
        uint32_t reg_slv_buf_addr_err_int_ena:1;
        /** reg_slv_cmd_err_int_ena : R/W; bitpos: [16]; default: 0;
         *  The enable bit for SPI_SLV_CMD_ERR_INT interrupt.
         */
        uint32_t reg_slv_cmd_err_int_ena:1;
        /** reg_mst_rx_afifo_wfull_err_int_ena : R/W; bitpos: [17]; default: 0;
         *  The enable bit for SPI_MST_RX_AFIFO_WFULL_ERR_INT interrupt.
         */
        uint32_t reg_mst_rx_afifo_wfull_err_int_ena:1;
        /** reg_mst_tx_afifo_rempty_err_int_ena : R/W; bitpos: [18]; default: 0;
         *  The enable bit for SPI_MST_TX_AFIFO_REMPTY_ERR_INT interrupt.
         */
        uint32_t reg_mst_tx_afifo_rempty_err_int_ena:1;
        /** reg_app2_int_ena : R/W; bitpos: [19]; default: 0;
         *  The enable bit for SPI_APP2_INT interrupt.
         */
        uint32_t reg_app2_int_ena:1;
        /** reg_app1_int_ena : R/W; bitpos: [20]; default: 0;
         *  The enable bit for SPI_APP1_INT interrupt.
         */
        uint32_t reg_app1_int_ena:1;
        uint32_t reserved_21:11;
    };
    uint32_t val;
} lp_spi_dma_int_ena_reg_t;


/** Group: LP SPI DMA INT CLR REG */
/** Type of spi_dma_int_clr register
 *  SPI DMA interrupt clear register
 */
typedef union {
    struct {
        uint32_t reserved_0:10;
        /** reg_slv_rd_buf_done_int_clr : WT; bitpos: [10]; default: 0;
         *  The clear bit for SPI_SLV_RD_BUF_DONE_INT interrupt.
         */
        uint32_t reg_slv_rd_buf_done_int_clr:1;
        /** reg_slv_wr_buf_done_int_clr : WT; bitpos: [11]; default: 0;
         *  The clear bit for SPI_SLV_WR_BUF_DONE_INT interrupt.
         */
        uint32_t reg_slv_wr_buf_done_int_clr:1;
        /** reg_trans_done_int_clr : WT; bitpos: [12]; default: 0;
         *  The clear bit for SPI_TRANS_DONE_INT interrupt.
         */
        uint32_t reg_trans_done_int_clr:1;
        uint32_t reserved_13:1;
        /** reg_spi_wakeup_int_clr : WT; bitpos: [14]; default: 0;
         *  The clear bit for SPI_WAKEUP_INT interrupt
         */
        uint32_t reg_spi_wakeup_int_clr:1;
        /** reg_slv_buf_addr_err_int_clr : WT; bitpos: [15]; default: 0;
         *  The clear bit for SPI_SLV_BUF_ADDR_ERR_INT interrupt.
         */
        uint32_t reg_slv_buf_addr_err_int_clr:1;
        /** reg_slv_cmd_err_int_clr : WT; bitpos: [16]; default: 0;
         *  The clear bit for SPI_SLV_CMD_ERR_INT interrupt.
         */
        uint32_t reg_slv_cmd_err_int_clr:1;
        /** reg_mst_rx_afifo_wfull_err_int_clr : WT; bitpos: [17]; default: 0;
         *  The clear bit for SPI_MST_RX_AFIFO_WFULL_ERR_INT interrupt.
         */
        uint32_t reg_mst_rx_afifo_wfull_err_int_clr:1;
        /** reg_mst_tx_afifo_rempty_err_int_clr : WT; bitpos: [18]; default: 0;
         *  The clear bit for SPI_MST_TX_AFIFO_REMPTY_ERR_INT interrupt.
         */
        uint32_t reg_mst_tx_afifo_rempty_err_int_clr:1;
        /** reg_app2_int_clr : WT; bitpos: [19]; default: 0;
         *  The clear bit for SPI_APP2_INT interrupt.
         */
        uint32_t reg_app2_int_clr:1;
        /** reg_app1_int_clr : WT; bitpos: [20]; default: 0;
         *  The clear bit for SPI_APP1_INT interrupt.
         */
        uint32_t reg_app1_int_clr:1;
        uint32_t reserved_21:11;
    };
    uint32_t val;
} lp_spi_dma_int_clr_reg_t;


