espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/lp_spi_struct.h
/** Group: LP SPI DMA INT RAW REG */
/** Type of spi_dma_int_raw register
 *  SPI DMA interrupt raw register
 */
typedef union {
    struct {
        uint32_t reserved_0:10;
        /** reg_slv_rd_buf_done_int_raw : R/WTC/SS; bitpos: [10]; default: 0;
         *  The raw bit for SPI_SLV_RD_BUF_DONE_INT interrupt. 1: SPI slave mode Rd_BUF
         *  transmission is ended. 0: Others.
         */
        uint32_t reg_slv_rd_buf_done_int_raw:1;
        /** reg_slv_wr_buf_done_int_raw : R/WTC/SS; bitpos: [11]; default: 0;
         *  The raw bit for SPI_SLV_WR_BUF_DONE_INT interrupt. 1: SPI slave mode Wr_BUF
         *  transmission is ended. 0: Others.
         */
        uint32_t reg_slv_wr_buf_done_int_raw:1;
        /** reg_trans_done_int_raw : R/WTC/SS; bitpos: [12]; default: 0;
         *  The raw bit for SPI_TRANS_DONE_INT interrupt. 1: SPI master mode transmission is
         *  ended. 0: others.
         */
        uint32_t reg_trans_done_int_raw:1;
        uint32_t reserved_13:1;
        /** reg_spi_wakeup_int_raw : R/WTC/SS; bitpos: [14]; default: 0;
         *  The raw bit for SPI_SPI_WAKEUP_INT interrupt. 1: There is a  wake up signal when
         *  low power mode. 0: Others.
         */
        uint32_t reg_spi_wakeup_int_raw:1;
        /** reg_slv_buf_addr_err_int_raw : R/WTC/SS; bitpos: [15]; default: 0;
         *  The raw bit for SPI_SLV_BUF_ADDR_ERR_INT interrupt. 1: The accessing data address
         *  of the current SPI slave mode CPU controlled FD, Wr_BUF or Rd_BUF transmission is
         *  bigger than 63. 0: Others.
         */
        uint32_t reg_slv_buf_addr_err_int_raw:1;
        /** reg_slv_cmd_err_int_raw : R/WTC/SS; bitpos: [16]; default: 0;
         *  The raw bit for SPI_SLV_CMD_ERR_INT interrupt. 1: The slave command value in the
         *  current SPI slave HD mode transmission is not supported. 0: Others.
         */
        uint32_t reg_slv_cmd_err_int_raw:1;
        /** reg_mst_rx_afifo_wfull_err_int_raw : R/WTC/SS; bitpos: [17]; default: 0;
         *  The raw bit for SPI_MST_RX_AFIFO_WFULL_ERR_INT interrupt. 1: There is a RX AFIFO
         *  write-full error when SPI inputs data in master mode. 0: Others.
         */
        uint32_t reg_mst_rx_afifo_wfull_err_int_raw:1;
        /** reg_mst_tx_afifo_rempty_err_int_raw : R/WTC/SS; bitpos: [18]; default: 0;
         *  The raw bit for SPI_MST_TX_AFIFO_REMPTY_ERR_INT interrupt. 1: There is a TX BUF
         *  AFIFO read-empty error when SPI outputs data in master mode. 0: Others.
         */
        uint32_t reg_mst_tx_afifo_rempty_err_int_raw:1;
        /** reg_app2_int_raw : R/WTC/SS; bitpos: [19]; default: 0;
         *  The raw bit for SPI_APP2_INT interrupt. The value is only controlled by application.
         */
        uint32_t reg_app2_int_raw:1;
        /** reg_app1_int_raw : R/WTC/SS; bitpos: [20]; default: 0;
         *  The raw bit for SPI_APP1_INT interrupt. The value is only controlled by application.
         */
        uint32_t reg_app1_int_raw:1;
        uint32_t reserved_21:11;
    };
    uint32_t val;
} lp_spi_dma_int_raw_reg_t;


/** Group: LP SPI DMA INT ST REG */
/** Type of spi_dma_int_st register
 *  SPI DMA interrupt status register
 */
typedef union {
    struct {
        uint32_t reserved_0:10;
        /** reg_slv_rd_buf_done_int_st : RO; bitpos: [10]; default: 0;
         *  The status bit for SPI_SLV_RD_BUF_DONE_INT interrupt.
         */
        uint32_t reg_slv_rd_buf_done_int_st:1;
        /** reg_slv_wr_buf_done_int_st : RO; bitpos: [11]; default: 0;
         *  The status bit for SPI_SLV_WR_BUF_DONE_INT interrupt.
         */
        uint32_t reg_slv_wr_buf_done_int_st:1;
        /** reg_trans_done_int_st : RO; bitpos: [12]; default: 0;
         *  The status bit for SPI_TRANS_DONE_INT interrupt.
         */
        uint32_t reg_trans_done_int_st:1;
        uint32_t reserved_13:1;
        /** reg_spi_wakeup_int_st : RO; bitpos: [14]; default: 0;
         *  reserved
         */
        uint32_t reg_spi_wakeup_int_st:1;
        /** reg_slv_buf_addr_err_int_st : RO; bitpos: [15]; default: 0;
         *  The status bit for SPI_SLV_BUF_ADDR_ERR_INT interrupt.
         */
        uint32_t reg_slv_buf_addr_err_int_st:1;
        /** reg_slv_cmd_err_int_st : RO; bitpos: [16]; default: 0;
         *  The status bit for SPI_SLV_CMD_ERR_INT interrupt.
         */
        uint32_t reg_slv_cmd_err_int_st:1;
        /** reg_mst_rx_afifo_wfull_err_int_st : RO; bitpos: [17]; default: 0;
         *  The status bit for SPI_MST_RX_AFIFO_WFULL_ERR_INT interrupt.
         */
        uint32_t reg_mst_rx_afifo_wfull_err_int_st:1;
        /** reg_mst_tx_afifo_rempty_err_int_st : RO; bitpos: [18]; default: 0;
         *  The status bit for SPI_MST_TX_AFIFO_REMPTY_ERR_INT interrupt.
         */
        uint32_t reg_mst_tx_afifo_rempty_err_int_st:1;
        /** reg_app2_int_st : RO; bitpos: [19]; default: 0;
         *  The status bit for SPI_APP2_INT interrupt.
         */
        uint32_t reg_app2_int_st:1;
        /** reg_app1_int_st : RO; bitpos: [20]; default: 0;
         *  The status bit for SPI_APP1_INT interrupt.
         */
        uint32_t reg_app1_int_st:1;
        uint32_t reserved_21:11;
    };
    uint32_t val;
} lp_spi_dma_int_st_reg_t;


/** Group: Interrupt registers */
/** Type of spi_dma_int_set register
 *  SPI interrupt software set register
 */
typedef union {
    struct {
        uint32_t reserved_0:10;
        /** spi_slv_rd_buf_done_int_set : WT; bitpos: [10]; default: 0;
         *  The software set bit for SPI_SLV_RD_BUF_DONE_INT interrupt.
         */
        uint32_t spi_slv_rd_buf_done_int_set:1;
        /** spi_slv_wr_buf_done_int_set : WT; bitpos: [11]; default: 0;
         *  The software set bit for SPI_SLV_WR_BUF_DONE_INT interrupt.
         */
        uint32_t spi_slv_wr_buf_done_int_set:1;
        /** spi_trans_done_int_set : WT; bitpos: [12]; default: 0;
         *  The software set bit for SPI_TRANS_DONE_INT interrupt.
         */
        uint32_t spi_trans_done_int_set:1;
        uint32_t reserved_13:2;
        /** spi_slv_buf_addr_err_int_set : WT; bitpos: [15]; default: 0;
         *  The software set bit for SPI_SLV_BUF_ADDR_ERR_INT interrupt.
         */
        uint32_t spi_slv_buf_addr_err_int_set:1;
        /** spi_slv_cmd_err_int_set : WT; bitpos: [16]; default: 0;
         *  The software set bit for SPI_SLV_CMD_ERR_INT interrupt.
         */
        uint32_t spi_slv_cmd_err_int_set:1;
        /** spi_mst_rx_afifo_wfull_err_int_set : WT; bitpos: [17]; default: 0;
         *  The software set bit for SPI_MST_RX_AFIFO_WFULL_ERR_INT interrupt.
         */
        uint32_t spi_mst_rx_afifo_wfull_err_int_set:1;
        /** spi_mst_tx_afifo_rempty_err_int_set : WT; bitpos: [18]; default: 0;
         *  The software set bit for SPI_MST_TX_AFIFO_REMPTY_ERR_INT interrupt.
         */
        uint32_t spi_mst_tx_afifo_rempty_err_int_set:1;
        /** spi_app2_int_set : WT; bitpos: [19]; default: 0;
         *  The software set bit for SPI_APP2_INT interrupt.
         */
        uint32_t spi_app2_int_set:1;
        /** spi_app1_int_set : WT; bitpos: [20]; default: 0;
         *  The software set bit for SPI_APP1_INT interrupt.
         */
        uint32_t spi_app1_int_set:1;
        uint32_t reserved_21:11;
    };
    uint32_t val;
} lp_spi_dma_int_set_reg_t;


/** Group: LP SPI SLEEP CONF0 REG */
/** Type of spi_sleep_conf0 register
 *  NA
 */
typedef union {
    struct {
        /** reg_slv_wk_char0 : R/W; bitpos: [7:0]; default: 10;
         *  NA
         */
        uint32_t reg_slv_wk_char0:8;
        /** reg_slv_wk_char_num : R/W; bitpos: [10:8]; default: 0;
         *  NA
         */
        uint32_t reg_slv_wk_char_num:3;
        /** reg_slv_wk_char_mask : R/W; bitpos: [15:11]; default: 0;
         *  NA
         */
        uint32_t reg_slv_wk_char_mask:5;
        /** reg_slv_wk_mode_sel : R/W; bitpos: [16]; default: 0;
         *  NA
         */
        uint32_t reg_slv_wk_mode_sel:1;
        /** reg_sleep_en : R/W; bitpos: [17]; default: 0;
         *  NA
         */
        uint32_t reg_sleep_en:1;
        /** reg_sleep_dis_rxfifo_wr_en : R/W; bitpos: [18]; default: 0;
         *  NA
         */
        uint32_t reg_sleep_dis_rxfifo_wr_en:1;
        /** reg_sleep_wk_data_sel : R/W; bitpos: [19]; default: 0;
         *  NA
         */
        uint32_t reg_sleep_wk_data_sel:1;
        uint32_t reserved_20:12;
    };
    uint32_t val;
} lp_spi_sleep_conf0_reg_t;


