espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/lp_spi_struct.h
/** Group: LP SPI SLEEP CONF1 REG */
/** Type of spi_sleep_conf1 register
 *  NA
 */
typedef union {
    struct {
        /** reg_slv_wk_char1 : R/W; bitpos: [7:0]; default: 11;
         *  NA
         */
        uint32_t reg_slv_wk_char1:8;
        /** reg_slv_wk_char2 : R/W; bitpos: [15:8]; default: 12;
         *  NA
         */
        uint32_t reg_slv_wk_char2:8;
        /** reg_slv_wk_char3 : R/W; bitpos: [23:16]; default: 13;
         *  NA
         */
        uint32_t reg_slv_wk_char3:8;
        /** reg_slv_wk_char4 : R/W; bitpos: [31:24]; default: 14;
         *  NA
         */
        uint32_t reg_slv_wk_char4:8;
    };
    uint32_t val;
} lp_spi_sleep_conf1_reg_t;


/** Group: LP SPI Wn REG */
/** Type of spi_wn register
 *  SPI CPU-controlled buffer
 */
typedef union {
    struct {
        /** reg_buf : R/W/SS; bitpos: [31:0]; default: 0;
         *  data buffer
         */
        uint32_t reg_buf:32;
    };
    uint32_t val;
} lp_spi_wn_reg_t;


/** Group: LP SPI SLAVE REG */
/** Type of spi_slave register
 *  SPI slave control register
 */
typedef union {
    struct {
        /** reg_clk_mode : R/W; bitpos: [1:0]; default: 0;
         *  SPI clock mode bits. 0: SPI clock is off when CS inactive 1: SPI clock is delayed
         *  one cycle after CS inactive 2: SPI clock is delayed two cycles after CS inactive 3:
         *  SPI clock is always on. Can be configured in CONF state.
         */
        uint32_t reg_clk_mode:2;
        /** reg_clk_mode_13 : R/W; bitpos: [2]; default: 0;
         *  {CPOL, CPHA},1: support spi clk mode 1 and 3, first edge output data B[0]/B[7].  0:
         *  support spi clk mode 0 and 2, first edge output data B[1]/B[6].
         */
        uint32_t reg_clk_mode_13:1;
        /** reg_rsck_data_out : R/W; bitpos: [3]; default: 0;
         *  It saves half a cycle when tsck is the same as rsck. 1: output data at rsck posedge
         *  0: output data at tsck posedge
         */
        uint32_t reg_rsck_data_out:1;
        uint32_t reserved_4:6;
        /** reg_slv_rdbuf_bitlen_en : R/W; bitpos: [10]; default: 0;
         *  1: SPI_SLV_DATA_BITLEN stores data bit length of master-read-slave data length in
         *  CPU controlled mode(Rd_BUF). 0: others
         */
        uint32_t reg_slv_rdbuf_bitlen_en:1;
        /** reg_slv_wrbuf_bitlen_en : R/W; bitpos: [11]; default: 0;
         *  1: SPI_SLV_DATA_BITLEN stores data bit length of master-write-to-slave data length
         *  in CPU controlled mode(Wr_BUF). 0: others
         */
        uint32_t reg_slv_wrbuf_bitlen_en:1;
        uint32_t reserved_12:14;
        /** reg_slave_mode : R/W; bitpos: [26]; default: 0;
         *  Set SPI work mode. 1: slave mode 0: master mode.
         */
        uint32_t reg_slave_mode:1;
        /** reg_soft_reset : WT; bitpos: [27]; default: 0;
         *  Software reset enable, reset the spi clock line cs line and data lines. Can be
         *  configured in CONF state.
         */
        uint32_t reg_soft_reset:1;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} lp_spi_slave_reg_t;


/** Group: LP SPI SLAVE1 REG */
/** Type of spi_slave1 register
 *  SPI slave control register 1
 */
typedef union {
    struct {
        /** reg_slv_data_bitlen : R/W/SS; bitpos: [17:0]; default: 0;
         *  The transferred data bit length in SPI slave FD and HD mode.
         */
        uint32_t reg_slv_data_bitlen:18;
        /** reg_slv_last_command : R/W/SS; bitpos: [25:18]; default: 0;
         *  In the slave mode it is the value of command.
         */
        uint32_t reg_slv_last_command:8;
        /** reg_slv_last_addr : R/W/SS; bitpos: [31:26]; default: 0;
         *  In the slave mode it is the value of address.
         */
        uint32_t reg_slv_last_addr:6;
    };
    uint32_t val;
} lp_spi_slave1_reg_t;


/** Group: LP SPI CLK GATE REG */
/** Type of spi_clk_gate register
 *  SPI module clock and register clock control
 */
typedef union {
    struct {
        /** reg_clk_en : R/W; bitpos: [0]; default: 0;
         *  Set this bit to enable clk gate
         */
        uint32_t reg_clk_en:1;
        /** reg_mst_clk_active : R/W; bitpos: [1]; default: 0;
         *  Set this bit to power on the SPI module clock.
         */
        uint32_t reg_mst_clk_active:1;
        /** reg_mst_clk_sel : R/W; bitpos: [2]; default: 0;
         *  This bit is used to select SPI module clock source in master mode. 1: PLL_CLK_80M.
         *  0: XTAL CLK.
         */
        uint32_t reg_mst_clk_sel:1;
        uint32_t reserved_3:29;
    };
    uint32_t val;
} lp_spi_clk_gate_reg_t;


/** Group: LP SPI DATE REG */
/** Type of spi_date register
 *  Version control
 */
typedef union {
    struct {
        /** reg_date : R/W; bitpos: [27:0]; default: 33591360;
         *  SPI register version.
         */
        uint32_t reg_date:28;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} lp_spi_date_reg_t;


/** Group: LP RND ECO CS REG */
/** Type of rnd_eco_cs register
 *  NA
 */
typedef union {
    struct {
        /** reg_rnd_eco_en : R/W; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t reg_rnd_eco_en:1;
        /** rnd_eco_result : RO; bitpos: [1]; default: 0;
         *  NA
         */
        uint32_t rnd_eco_result:1;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} lp_rnd_eco_cs_reg_t;


/** Group: LP RND ECO LOW REG */
/** Type of rnd_eco_low register
 *  NA
 */
typedef union {
    struct {
        /** reg_rnd_eco_low : R/W; bitpos: [31:0]; default: 0;
         *  NA
         */
        uint32_t reg_rnd_eco_low:32;
    };
    uint32_t val;
} lp_rnd_eco_low_reg_t;


/** Group: LP RND ECO HIGH REG */
/** Type of rnd_eco_high register
 *  NA
 */
typedef union {
    struct {
        /** reg_rnd_eco_high : R/W; bitpos: [31:0]; default: 65535;
         *  NA
         */
        uint32_t reg_rnd_eco_high:32;
    };
    uint32_t val;
} lp_rnd_eco_high_reg_t;


typedef struct {
    volatile lp_spi_cmd_reg_t spi_cmd;
    volatile lp_spi_addr_reg_t spi_addr;
    volatile lp_spi_ctrl_reg_t spi_ctrl;
    volatile lp_spi_clock_reg_t spi_clock;
    volatile lp_spi_user_reg_t spi_user;
    volatile lp_spi_user1_reg_t spi_user1;
    volatile lp_spi_user2_reg_t spi_user2;
    volatile lp_spi_ms_dlen_reg_t spi_ms_dlen;
    volatile lp_spi_misc_reg_t spi_misc;
    volatile lp_spi_din_mode_reg_t spi_din_mode;
    volatile lp_spi_din_num_reg_t spi_din_num;
    volatile lp_spi_dout_mode_reg_t spi_dout_mode;
    volatile lp_spi_dma_conf_reg_t spi_dma_conf;
    volatile lp_spi_dma_int_ena_reg_t spi_dma_int_ena;
    volatile lp_spi_dma_int_clr_reg_t spi_dma_int_clr;
    volatile lp_spi_dma_int_raw_reg_t spi_dma_int_raw;
    volatile lp_spi_dma_int_st_reg_t spi_dma_int_st;
    volatile lp_spi_sleep_conf0_reg_t spi_sleep_conf0;
    volatile lp_spi_sleep_conf1_reg_t spi_sleep_conf1;
    volatile lp_spi_dma_int_set_reg_t spi_dma_int_set;
    uint32_t reserved_050[18];
    volatile lp_spi_wn_reg_t data_buf[16];
    uint32_t reserved_0d8[2];
    volatile lp_spi_slave_reg_t spi_slave;
    volatile lp_spi_slave1_reg_t spi_slave1;
    volatile lp_spi_clk_gate_reg_t spi_clk_gate;
    uint32_t reserved_0ec;
    volatile lp_spi_date_reg_t spi_date;
    volatile lp_rnd_eco_cs_reg_t rnd_eco_cs;
    volatile lp_rnd_eco_low_reg_t rnd_eco_low;
    volatile lp_rnd_eco_high_reg_t rnd_eco_high;
} lp_spi_dev_t;

extern lp_spi_dev_t LP_SPI;

#ifndef __cplusplus
_Static_assert(sizeof(lp_spi_dev_t) == 0x100, "Invalid size of lp_dev_t structure");
#endif

#ifdef __cplusplus
}
#endif
